// Simple array of projects
var projects = [
  {
    "meta": "kool-econtact",
    "name": "Dynamic e-Namecard",
    "description": "UX UI Design",
    "type": "uiux",
    "for": "Kool",
    "published": "Dec 2025",
    "feature": "yes",
    "innerDescription": [
      {
        "title": "Digital Networking Reimagined",
        "description": "In the digital era, traditional business cards are fading. This project introduces a modern E-Namecard solution designed for instant sharing and seamless integration. By replacing paper with pixels, we offer a sustainable, always-accessible professional identity that eliminates manual data entry and adapts to the modern professional's needs."
      },
      {
        "title": "AI-Assisted Design & bilingual Support",
        "description": "Leveraging AI tools during the development phase, we have crafted dynamic, high-quality templates that cater specifically to a dual-language audience. The system fully supports both English and Hong Kong Traditional Chinese. The design ensures that whether a client views the card in English or Chinese, the layout remains polished, professional, and culturally attuned."
      },
      {
        "title": "User Interface Design and Visual Hierarchy",
        "description": "The front-end user interface is designed with a 'mobile-first' philosophy, prioritizing visual impact and ease of navigation. Key design elements include a prominent, eye-catching profile picture and a clean presentation of the user's name and professional details. To ensure accessibility, a language toggle switch is strategically placed in the top-right corner, allowing viewers to instantly swap between English and Chinese versions of the profile without reloading the page or losing context."
      },
      {
        "title": "Frictionless Connectivity via Floating Action Button",
        "description": [
          "To maximize conversion—defined here as successfully saving a contact—we have engineered a persistent User Experience (UX) feature. A floating 'Add Contact' button remains sticky at the bottom of the screen, hovering above the content regardless of how far the user scrolls. This eliminates the need to scroll to the footer to find action buttons. Upon clicking, this button triggers the device’s native contact application, prompting the user to save the new contact immediately."
        ]
      },
      {
        "title": "Internal Generator & VCF Export Workflow",
        "description": "For internal efficiency, we utilized AI to help code a custom E-Namecard generator interface. This tool allows administrators to input personal data once and automatically export two distinct vCard (.vcf) files—one in English and one in Chinese. This ensures that the downloadable contact file always matches the language currently displayed on the screen."
      }
    ],
    "img": 4,
    "download": "https://contacts.koolfoundation.org/#sampleau",
    "downloadText": "view demo"
  },
  {
    "meta": "product-viewer",
    "name": "3D Model Viewer",
    "description": "AR/VR app development",
    "type": "uiux",
    "for": "Kool",
    "published": "Apr 2025",
    "feature": "yes",
    "innerDescription": [
      {
        "title": "Project Overview",
        "description": "I collaborated on a design thinking initiative that brought together cross-functional teams from sales, merchandising, engineering, accounting, and shipping. This diverse collaboration was essential as we generated innovative ideas aimed at enhancing business processes. I led the design project to develop a virtual prototyping web app, working closely with design team members and leveraging the power of AI to streamline our efforts."
      },
      {
        "title": "Collaborative Design Thinking",
        "description": "The first phase of the project focused on design thinking, where we brainstormed several business innovation ideas. By integrating insights from various departments, we identified key areas for improvement and developed solutions that could transform our approach to product development. The integration of AI played a significant role in this phase, helping us analyze data and generate creative concepts more efficiently. This technological aid allowed us to explore possibilities that might have otherwise been overlooked, enriching our design process."
      },
      {
        "title": "Development for Enhanced Prototyping",
        "description": "In the second phase, I directed the development of the app, ensuring it effectively reflected the insights gained during our initial discussions. The virtual prototyping web app minimizes the initial prototyping efforts, allowing clients to explore and interact with 3D models before creating physical prototypes. While clients will ultimately want a tangible object to examine, this app significantly reduces the time and resources spent on preliminary designs. By enabling virtual exploration, clients can make informed decisions and adjustments early in the design process, ultimately leading to more successful final products."
      },
      {
        "title": "Intuitive User Experience",
        "description": [
          "The app is designed with user-friendliness in mind, allowing clients to easily navigate and interact with their 3D models. Users can seamlessly browse preload models or open their own files with just a few clicks. The interface is intuitive, enabling users to drag and reposition components effortlessly, and rotate the models simply by swiping on the screen.",
          "A standout feature of the app is its augmented reality (AR) capability, which bridges the virtual and physical worlds. This powerful functionality allows clients to visualize new product designs in real-time, placing virtual prototypes alongside existing products or within actual environments. By seeing how a new design fits within the context of previous versions or the product family, clients gain a deeper understanding of its impact and can make more informed decisions."
        ]
      },
      {
        "title": "Conclusion",
        "description": "Overall, this project not only showcases my technical skills but also emphasizes the importance of collaboration and innovation in product development. By merging design thinking with advanced technology, we created a solution that significantly enhances the way clients visualize and interact with their designs, ultimately driving business success."
      }
    ],
    "img": 6,
    "download": "https://product-viewer.francispun.com/",
    "downloadText": "view demo"
  },
  {
    "meta": "financeschool",
    "name": "Finance School",
    "description": "UX Design",
    "type": "uiux",
    "for": "Google UX Design Course",
    "published": "Aug 2022",
    "feature": "",
    "innerDescription": [
      "The Finance School project is a student endeavor undertaken as part of the Google UX Design Professional Certificate program, with a focus on designing for social good. The objective of this project was to address the need for improved financial and economic knowledge among young adults, enabling them to effectively utilize fintech tools to enhance their financial well-being.",
      "As a UX designer, my role encompassed a comprehensive range of tasks and responsibilities. This included creating detailed personas to understand the target audience, developing both paper and digital wireframes to visualize the app and website interfaces, crafting low and high-fidelity prototypes for conducting rigorous usability studies, establishing an effective information architecture, ensuring accessibility considerations were integrated into the design process, and iteratively refining the designs based on feedback and insights."
    ],
    "img": 16,
    "download": "https://www.figma.com/proto/2vvhkAjarIzuCTH82jvv7T/financeschool-app?node-id=85%3A631&scaling=scale-down&page-id=85%3A630&starting-point-node-id=85%3A631",
    "downloadText": "view prototype"
  },
  {
    "meta": "catdogplanet",
    "name": "Cat Dog Planet",
    "description": "UX design",
    "type": "uiux",
    "for": "Google UX Design Course",
    "published": "Aug 2022",
    "feature": "",
    "innerDescription": [
      "The Cat Dog Planet project is a student endeavor undertaken as part of the Google UX Design Professional Certificate program. The project focuses on designing an app for an imaginary pet shop and adoption center that goes by the name of Cat Dog Planet.",
      "As a UX designer, my primary objective was to create an app that places significant emphasis on simplifying and enhancing the pet adoption process. In Hong Kong, where most adoption centers rely on social media platforms for adoption applications, there exists a potential gap that the app seeks to address.",
      "Throughout the project, I assumed the responsibility of various key tasks. This included creating detailed personas to gain a comprehensive understanding of the target audience and their needs. Additionally, I designed both paper and digital wireframes to conceptualize the app's user interface. To bring the designs to life, I developed low and high-fidelity prototypes that were used to conduct usability studies, allowing for valuable user feedback.",
      "The project's iterative design process allowed for continuous improvement and refinement of the app's functionality and user experience. By addressing the identified gap in the adoption process through an intuitive and user-centric design approach, the Cat Dog Planet app aims to streamline and enhance the adoption experience for both prospective pet owners and the pet shop itself."
    ],
    "img": 11,
    "download": "https://www.figma.com/proto/5zEOO2kpHDeMzjldyp71qR/Cat-Dog-Planet-(final)?node-id=68%3A1484&scaling=scale-down&page-id=57%3A17&starting-point-node-id=68%3A1831&show-proto-sidebar=1",
    "downloadText": "view prototype"
  },
  {
    "meta": "francispun.com",
    "name": "francispun.com",
    "description": "web portfolio",
    "type": "uiux",
    "for": "myself",
    "published": "Jul 2022",
    "feature": "yes",
    "innerDescription": [
      {
        "title": "Embracing Challenges",
        "description": "This web design project serves as a valuable opportunity for me to enhance my front-end development skills while creating a portfolio to showcase my abilities. Deployed on a static-site host, the website is developed using HTML, CSS, and JavaScript exclusively. Throughout the development process, I encountered numerous challenges, but I took initiative in conducting extensive research and leveraging online resources such as Google and Stack Overflow to overcome these obstacles. The satisfaction derived from independently devising solutions for various functions and features was truly fulfilling."
      },
      {
        "title": "Establishing a Brand Presence",
        "description": [
          "The landing page of the website features a meticulously crafted design. It incorporates my profile picture, accompanied by a concise description highlighting my identity and professional aspirations. The deliberate utilization of a vibrant yellow background aims to establish a distinct brand presence, fostering recognition and association with my personal brand.",
          "The logo serves as a visual representation of my diverse skill set. It takes the form of a 2D hexagon, which can also be perceived as a flattened 3D cube. Imprinted on this structure are my initials, F and P, symbolizing my proficiency in both 2D and 3D design realms. The hexagon assumes a pivotal role as the primary visual element throughout the website, reinforcing its visual identity and thematic consistency."
        ]
      },
      "I wholeheartedly invite you to provide feedback regarding any potential UI/UX concerns or suggestions for improvement. Your valuable insights will be greatly appreciated, as I am committed to refining and enhancing this website to deliver an exceptional user experience."
    ],
    "img": 0
  },
  {
    "meta": "kool-shopline",
    "name": "Kool E-Commerce",
    "description": "web layout and style design",
    "type": "uiux",
    "for": "Kool",
    "published": "Jan 2022",
    "feature": "",
    "innerDescription": [
      "The Kool e-commerce website project involved the design and development of an online store using the Shopline e-commerce platform, which shares similarities with popular platforms like Shopify. As the designer, my primary responsibility was to create an appealing layout and visually captivating style for the website.",
      "Working with the provided content, I carefully crafted the design elements to ensure a seamless and engaging user experience. This included designing the overall layout of the website, organizing product categories, and creating visually appealing product pages. The goal was to create an intuitive and visually engaging interface that would attract potential customers. I customized the website's appearance to align with the unique branding and identity of Kool. Attention was given to ensuring that the design elements and visual style reflected the essence of the brand, creating a cohesive and memorable online shopping experience."
    ],
    "img": 4
  },
  {
    "meta": "arctomys",
    "name": "Arctomys",
    "description": "bag design and visual branding",
    "type": "product-design",
    "for": "Arctomys",
    "published": "2018 - 2021",
    "feature": "",
    "innerDescription": [
      {
        "title": "Building a Distinctive Accessories Brand",
        "description": "I partnered with another designer to launch a fashion accessories brand, creating a collection of bags that balanced bold style with everyday function. We designed the EABA bucket bag, TOFLIP tote bag, and Demas sacoche bag. They were crafted to elevate diverse lifestyles."
      },
      {
        "title": "Creating Versatile Designs",
        "description": "The EABA bucket bag, made from 16oz waxed cotton canvas with a water-resistant lining, blends a sleek profile with space for essentials like a water bottle, wallet, and umbrella, plus three side pockets for smaller items. The TOFLIP tote bag, double-sided with earthy cotton canvas on one side and glossy polyester on the other, shifts effortlessly from laid-back to polished looks. The Demas sacoche bag, built from waxed canvas with three compartments, delivers minimalist utility for daily needs."
      },
      {
        "title": "Showcasing Through Visuals",
        "description": "Beyond designing the bags, I crafted a compelling lookbook for the EABA, TOFLIP, and Demas, handling most of the photography and retouching myself. This visual storytelling secured our first consignment deals, highlighting my ability to translate design into persuasive marketing."
      },
      {
        "title": "Expanding with Miffy Designs",
        "description": "By securing a Miffy license, we reimagined the Eaba bucket bag as a Miffy edition, which gained strong traction. This led to two more designs: a Demas Sacoche featuring Miffy’s face and a lunchbox bag with a detachable strap and side storage. These playful yet practical pieces underscored my knack for market-driven creativity."
      }
    ],
    "img": 11,
    "download": "./downloads/arctomy lookbook - print.pdf",
    "downloadText": "download lookbook"
  },
  {
    "meta": "sachellecollective",
    "name": "Sachelle Collective",
    "description": "product photography",
    "type": "multimedia-design",
    "for": "Sachelle Collective",
    "published": "Aug 2021",
    "feature": "",
    "innerDescription": [
      "The Sachelle Collective New Collection Launch is an exciting freelance photography project focused on capturing stunning visuals for the brand's latest line of jewelry. The collection comprises a range of exquisite necklaces, earrings, and rings, showcasing the brand's commitment to style.",
      {
        "title": "Pure Product Shooting",
        "description": "Capturing high-quality images of the jewelry pieces individually, highlighting their intricate details, unique designs, and fine materials. This ensures that potential customers can appreciate the beauty of each item."
      },
      {
        "title": "Model Shooting",
        "description": "Showcasing the jewelry collection in a real-life context by capturing images of models wearing the jewelry. The photographs provide a sense of how the pieces look when worn, allowing potential customers to visualize themselves wearing the collection and inspiring them to make a purchase."
      },
      "Throughout the project, utmost attention is given to lighting, composition, and styling to ensure that the photographs effectively convey the elegance and allure of the Sachelle Collective's new collection."
    ],
    "img": 11
  },
  {
    "meta": "qdo-photography",
    "name": "QDO",
    "description": "product photography",
    "type": "multimedia-design",
    "for": "QDO",
    "published": "2020 - 2021",
    "feature": "",
    "innerDescription": [
      "The QDO Photography Project involved multiple assignments for social media, e-commerce, packaging, and product launching press releases. As the designer, I was responsible for creating layouts, selecting props, and setting up lighting to capture the Scandinavian vibe of this lifestyle tableware brand.",
      "With a focus on coffee and tea items, the photography aimed to showcase the unique Scandinavian aesthetic of QDO. For social media and e-commerce, I carefully arranged the tableware, utilized suitable props, and employed lighting techniques to create visually appealing images that would attract potential customers. The goal was to convey the brand's quality and sophistication while evoking a sense of lifestyle and ambiance."
    ],
    "img": 8
  },
  {
    "meta": "qdo-uxui",
    "name": "QDO",
    "description": "UI / UX",
    "type": "uiux",
    "for": "QDO",
    "published": "Jul 2021",
    "feature": "",
    "innerDescription": [
      "The QDO Website project was created with the primary goal of engaging both B2B clients and B2C customers. The website design caters to the specific needs of these two target audiences, offering distinct features to enhance their experience with the brand.",
      "For B2B clients, the website incorporates mood boards and detailed product information to provide a comprehensive understanding of QDO's brand image and the potential business opportunities that exist. The mood boards visually communicate the brand's identity and aesthetic, while the product details offer insights into the range of products available and their unique features. This information helps B2B clients make informed decisions and explore potential collaborations with QDO.",
      "Simultaneously, the website provides a seamless shopping experience for B2C customers through an Amazon brand store link. This feature allows interested B2C customers to directly access and purchase QDO products via the trusted and widely recognized Amazon platform. By providing this convenient shopping option, the website effectively caters to the needs and preferences of its target audiences, enabling them to easily discover and purchase QDO's lifestyle tableware.",
      "The overall objective of the project was to create a versatile and user-friendly website that serves both B2B and B2C purposes. By offering comprehensive brand information and facilitating convenient online shopping, the QDO website successfully engages and caters to the diverse needs of its target audiences, fostering business collaborations and driving direct consumer sales."
    ],
    "img": 13,
    "download": "https://drive.google.com/file/d/1tPtw8DiiWZxFjbhPeQm2ZZpLZeZtlUKc/view?usp=sharing",
    "downloadText": "download  diagram"
  },
  {
    "meta": "homeasy-uxui",
    "name": "Homeasy ",
    "description": "UI / UX",
    "type": "uiux",
    "for": "Homeasy",
    "published": "May 2021",
    "feature": "yes",
    "innerDescription": [
      "The Homeasy Website Project focuses on engaging and converting B2B clients through a strategically designed website. The primary objective is to showcase Homeasy's products and their backgrounds, establishing credibility and trust with potential clients.",
      "Through compelling product presentations and informative content, the website effectively communicates the value and benefits of Homeasy's offerings. The design and layout of the website are carefully crafted to capture the attention of B2B clients and provide a seamless user experience.",
      "The project further aims to build trust and credibility by sharing the backgrounds and expertise of Homeasy. This helps potential clients understand the company's experience and knowledge in delivering high-quality products and services. The website strategically incorporates this information to position Homeasy as a reliable and reputable partner for B2B collaborations.",
      "To convert B2B clients into sales leads, the website implements effective call-to-action elements and lead generation strategies. These include clear and compelling prompts for potential clients to contact Homeasy, request more information, or engage in further discussions about potential collaborations. By facilitating seamless communication and providing easy access to relevant contact information, the website project aims to generate valuable sales leads and foster long-term business relationships."
    ],
    "img": 5,
    "download": "https://drive.google.com/file/d/1eh2KcNj2OfLX-M6ZUI4L6ht7ULQqlQut/view?usp=sharing",
    "downloadText": "download diagram"
  },
  {
    "meta": "kai-shop",
    "name": "Kai Shop",
    "description": "visual merchandising design",
    "type": "multimedia-design",
    "for": "Kai",
    "published": "Jul 2020",
    "feature": "",
    "innerDescription": [
      {
        "title": "Elevating the Kai Retail Experience",
        "description": [
          "The design of KAI shop was driven by a desire to celebrate the brand's over 110-year rich history, showcase its exceptional craftsmanship, and create a visually captivating and informative shopping experience. To achieve this, I envisioned a museum-like presentation that would educate and captivate visitors, ultimately driving sales."
        ]
      },
      {
        "title": "Highlighting the Flagship Knife Series",
        "description": [
          "I dedicated a specific column to feature two knives from Kai's most exclusive and high-end series. By giving these premium products a dedicated space, I aimed to introduce customers to the brand's top-of-the-line offerings and encourage them to explore the brand's diverse product range."
        ]
      },
      {
        "title": "Rebranding for Enhanced Appeal",
        "description": [
          "To better promote Kai's two well-known series, the lower-end Sekimagoroku and the higher-end Shun Premier, I decided to replace the previous branding with a more visually striking golden film logo. This change was intended to elevate the product presentation and make it more appealing to customers.",
          "To further enhance the customer experience, I created informative product boards that showcased the beauty and craftsmanship of the Kai knives. By utilizing high-quality product photos and thoughtful product descriptions, I aimed to educate and inspire customers, ultimately driving increased sales."
        ]
      }
    ],
    "img": 4
  },
  {
    "meta": "kai-marketing",
    "name": "Kai ",
    "description": "marketing designs",
    "type": "multimedia-design",
    "for": "Kai",
    "published": "2019 - 2020",
    "feature": "",
    "innerDescription": [
      "As a designer supporting the Kai marketing team, I was responsible for creating a variety of assets to help promote the brand and its products. This included developing engaging social media content as well as other miscellaneous design projects.",
      {
        "title": "Social Media Content Creation",
        "description": [
          "For the social media aspect of the work, my focus was on crafting informative and visually compelling posts and images that could effectively showcase Kai's products and brand messaging. By highlighting the products' key features and benefits, and demonstrating their practical applications, I aimed to drive awareness, interest, and ultimately sales through the social media channels."
        ]
      },
      {
        "title": "Other Design Projects",
        "description": [
          "Beyond the social media content, I also worked on other design projects for Kai on an as-needed basis. This included things like packaging design, promotional video editing, and various other marketing materials. While these were more miscellaneous in nature, my approach was to maintain a cohesive brand aesthetic and messaging across all the assets I produced. Throughout this work, I strived to develop practical, informative, and visually engaging designs that would effectively support Kai's marketing initiatives."
        ]
      }
    ],
    "img": 3,
    "video": [
      "src=\"https://player.vimeo.com/video/447344251?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"",
      "src=\"https://player.vimeo.com/video/441217542?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"",
      "src=\"https://player.vimeo.com/video/440904843?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"",
      "src=\"https://player.vimeo.com/video/441219280?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"450\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "kai-shun",
    "name": "Kai Shun",
    "description": "product photography",
    "type": "multimedia-design",
    "for": "Kai",
    "published": "Jun 2020",
    "feature": "",
    "innerDescription": [
      {
        "title": "Capturing the Essence of Shun",
        "description": [
          "To capture the intricate details and textures of the Shun, I carefully designed the lighting setup to accentuate the unique forging pattern of the blades. Damasus steel is created by forge-welding multiple layers of steel, resulting in a distinctive rippled, wave-like appearance on the blade's surface."
        ]
      },
      {
        "title": "Elevating the In-Store Experience",
        "description": [
          "The fresh images beautifully captured the essence of the Shun products, showcasing their high-quality, refined aesthetic. These visually striking photographs were designed to elevate the in-store experience and attract the attention of customers.",
          "This marketing strategy aims to increase brand awareness and generate interest among shoppers, allowing them to fully appreciate the premium craftsmanship of the damasus knives."
        ]
      }
    ],
    "img": 4
  },
  {
    "meta": "snap-n-flag",
    "name": "Snap 'n Flag",
    "description": "knife system design",
    "type": "product-design",
    "for": "Kai",
    "published": "Dec 2019",
    "feature": "yes",
    "innerDescription": [
      "Snap 'n flag is a personalized knife storing system. With the shaft stand, users can snap the knife sheaths to the shaft as a knife holder. Users can personalize the combination of knives to fit their daily practice. On the sheath, there is a feature called \"finger rest\". It is designed for users to hold the sheath and pull the knife out."
    ],
    "img": 0,
    "video": [
      "src=\"https://player.vimeo.com/video/440905990?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "slickcase",
    "name": "Slick Case",
    "description": "marketing designs",
    "type": "multimedia-design",
    "for": "Slick Case",
    "published": "2018 - 2019",
    "feature": "",
    "innerDescription": [
      "Multiple design projects are designed for the Slick Case marketing team for their website, social media, and editorials."
    ],
    "img": 9,
    "gif": 3
  },
  {
    "meta": "sportsoho",
    "name": "Sportsoho",
    "description": "3D renderings",
    "type": "multimedia-design",
    "for": "Multi-clients: Pocari, FWD",
    "published": "2018 - 2019",
    "feature": "",
    "innerDescription": [
      "3D visualization designs for Sportsoho's event proposals for their clients. The renderings were also used in their later advertisement."
    ],
    "img": 15
  },
  {
    "meta": "hkpa",
    "name": "HKPA",
    "description": "graphic designs",
    "type": "multimedia-design",
    "for": "HKPA",
    "published": "2018 - 2019",
    "feature": "",
    "innerDescription": [
      "Event backdrop designs and booklet designs for HKPA event."
    ],
    "img": 12
  },
  {
    "meta": "kool-website",
    "name": "Kool website",
    "description": "web design",
    "type": "uiux",
    "for": "Kool",
    "published": "Sep 2017",
    "feature": "",
    "innerDescription": [
      "This is a web design project for Kool. I was responsible for the whole project, from graphic design, to layout, to prototyping, to communication with the developer, and to content data entry for launching. During the development period, the prototype was used to conduct user experience interviews with management to get feedback and approval. Management believed it's better to have all icons on the nav bar than text. After the compromise, there was a mouse-over effect to switch the nav bar icons to text. The website was no longer active after 2019."
    ],
    "img": 0,
    "download": "./kool-demo/index.html",
    "downloadText": "test prototype"
  },
  {
    "meta": "citrus-reamer-tongs",
    "name": "Citrus Reamer Tongs",
    "description": "awarded kitchenware design",
    "type": "product-design",
    "for": "Kool",
    "published": "Mar 2017",
    "feature": "yes",
    "innerDescription": [
      {
        "title": "Juicing and Grasping in One Clever Tool",
        "description": [
          "Citrus Reamer Tongs combines the functionality of tongs with the juicing prowess of a citrus reamer. This innovative utensil streamlines your kitchen tasks, elevating your cooking experience with a splash of fresh citrus flavor.",
          "The Citrus Reamer Tongs feature a smart design at their core. The V-shaped tip and reamer head, inspired by a fish's fin, allow for precise juice extraction - perfect for adding a zesty kick to seafood, pasta, and more. No more switching between tools, the Citrus Reamer Tongs have you covered.",
          "Crafted from durable, nylon-reinforced composite, these tongs are built to withstand the rigors of the kitchen. Their adjustable width, with three customizable settings, ensures a secure grip on ingredients big and small. And for easy storage, the built-in hanging hole makes them a seamless addition to any kitchen."
        ]
      },
      {
        "title": "Design Excellence Recognized",
        "description": [
          "The Citrus Reamer Tongs embody the pursuit of design efficiency and multifunctionality. Their recognition with renowned awards, including the Golden Pin Design Award and The International Design Awards (IDA), is a testament to their excellence in both form and function."
        ]
      }
    ],
    "img": 2,
    "video": [
      "width=\"672\" height=\"378\" src=\"https://www.youtube.com/embed/U5iLyS9z6nk?rel=0&amp;showinfo=0\" frameborder=\"0\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "4-in-1-splatter-guard",
    "name": "4 in 1 Splatter Guard",
    "description": "foldable splatter guard",
    "type": "product-design",
    "for": "Kool",
    "published": "Mar 2017",
    "feature": "",
    "innerDescription": [
      "A multifunctional 4-in-1 design, can be a splatter guard, strainer, cooling rack, and baking sheet. Foldable and featuring locking handles for secure and compact storage. Non-stick and easy to clean, won’t stain or retain odors. 330mm / 13-inches diameter, suitable for most standard size pans."
    ],
    "img": 0
  },
  {
    "meta": "capsule",
    "name": "Capslue",
    "description": "snack bar mold and to-go",
    "type": "product-design",
    "for": "Kool",
    "published": "Mar 2017",
    "feature": "yes",
    "innerDescription": [
      "Encourage the healthy life food trend by making your snack bars. With its dual-function lid, it acts as a snack bar mold press as well as a to-go container. The sliding lid feature allows for an opening of selected compartments. Silicone mold makes popping out the snack bars easy. Carries up to 4 snack bars for a full day of supplemental energy. The compact size is perfect for any bag."
    ],
    "img": 0,
    "video": [
      "width=\"672\" height=\"378\" src=\"https://www.youtube.com/embed/kpo0y8EprO4?rel=0&amp;showinfo=0\" frameborder=\"0\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "novexpert",
    "name": "Novexpert",
    "description": "CG animation",
    "type": "multimedia-design",
    "for": "Topix Ltd.",
    "published": "Nov 2016",
    "feature": "",
    "innerDescription": [
      "This is a freelance project for Novexpert, a client of Topix Ltd. I was responsible for animation design and rendering. The after-effects and the voice-over were done by the Topix production team."
    ],
    "img": 0,
    "video": [
      "src=\"https://player.vimeo.com/video/256956404?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"",
      "src=\"https://player.vimeo.com/video/256956409?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"",
      "src=\"https://player.vimeo.com/video/256956415?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"",
      "src=\"https://player.vimeo.com/video/256957228?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "aqualibrum",
    "name": "Aqualibrum",
    "description": "showerstall",
    "type": "product-design",
    "for": "FYP - BA(Hons) in Design",
    "published": "Jun 2015",
    "feature": "",
    "innerDescription": [
      "It is a shower stall with a water tank and a countdown clock display for raising awareness of the amount of water used. The water tank is filling up with water at a rate of 3.5 L/min. It forces the users to balance the comfort and the environmental impact when showering by adjusting the amount of water used."
    ],
    "img": 0,
    "video": [
      "src=\"https://player.vimeo.com/video/130718709?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "hksn",
    "name": "HKSN",
    "description": "graphic designs",
    "type": "multimedia-design",
    "for": "HKSN",
    "published": "Sept 2015",
    "feature": "",
    "innerDescription": [
      "Online advert banner designs for HKSN to promote their nutrition supplements."
    ],
    "img": 5
  },
  {
    "meta": "pay-imhome-queue",
    "name": "Pay.ImHome.Queue",
    "description": "japanese cultural souvenir",
    "type": "product-design",
    "for": "JP Study Trip - BA(Hons) in Design",
    "published": "Aug 2014",
    "feature": "",
    "innerDescription": [
      "Pay.ImHome.Queue is a Japanese cultural souvenir collection. Mantha and I wanted to highlight and remind the tourists of the interesting cultural behaviors of the Japanese. We have this idea after we traveled to Japan together. We both very much appreciate the culture and aesthetic of the olden days of Japan. We therefore designed them like a folk toy."
    ],
    "img": 0
  },
  {
    "meta": "fang-studio",
    "name": "Fang Studio Ltd.",
    "description": "product photography",
    "type": "multimedia-design",
    "for": "Fang Studio Ltd.",
    "published": "Aug 2014",
    "feature": "",
    "innerDescription": [
      "Photography projects done during internship"
    ],
    "img": 7
  },
  {
    "meta": "stackply",
    "name": "Stackply",
    "description": "stackable plywood chair",
    "type": "product-design",
    "for": "Furniture Design - BA(Hons) in Design",
    "published": "May 2014",
    "feature": "",
    "innerDescription": [
      "Catherine and I aimed at designing a lightweight stackable plywood chair. We wanted to make it as lightweight as possible to respond to the properties of plywood. The profile of the side view is designed to echo the silhouette of the back of a human body geometrically. Material-wise, we tried to avoid using irregular shapes to Minimize the waste of material.",
      "Size : 448mm x 425mm x 825mm seat H : 450mm",
      "Material : plywood"
    ],
    "img": 0
  },
  {
    "meta": "patches",
    "name": "Patches",
    "description": "handmade boots",
    "type": "product-design",
    "for": "Shoes Design - BA(Hons) in Design",
    "published": "Dec 2013",
    "feature": "",
    "innerDescription": [
      "PATCHES is a pair of boots with a patching style that is transformed from the idea \"I want to repair old shoes for my use.\". It targets fashionable youngsters who would like to carry a little bit of taste of vintage."
    ],
    "img": 3
  },
  {
    "meta": "emacau",
    "name": "eMacau",
    "description": "UI design",
    "type": "uiux",
    "for": "Macau Gov",
    "published": "Jan 2014",
    "feature": "",
    "innerDescription": [
      "It is a project to design a payment user interface for Macau Government when I was working at BIC Ltd. to design. The user flow was designed and I was only responsible for designing the graphic interface."
    ],
    "img": 4
  },
  {
    "meta": "eleggression",
    "name": "Eleggression",
    "description": "3D printed shoes",
    "type": "product-design",
    "for": "Shoes Design - BA(Hons) in Design",
    "published": "Dec 2013",
    "feature": "",
    "innerDescription": [
      "A pair of runway shoes merging elegance and aggression is designed and produced with 3D printing. Since 3D printing breaks a lot of limitations of a form, I was challenging a new sense of aesthetics through it."
    ],
    "img": 2
  },
  {
    "meta": "jofab",
    "name": "JOFAB",
    "description": "foldable boat",
    "type": "product-design",
    "for": "Design for Leisure - BA(Hons) in Design",
    "published": "Jun 2013",
    "feature": "",
    "innerDescription": [
      "Jofab is a mini foldable boat for teens to use at the beach and calm water area. It is aimed at providing a new boating experience for teens. Jofab is different from other boats as it is used origami elements. Teens need to construct the boat by themselves and turn the origami boat into a real boat. Through this process, they can enjoy the sense of success and satisfaction.",
      "Weight : 4.5 kg Load : 50 kg",
      "Material : canvas // coroplast",
      "Size : 130cm x 48cm~70cm x 30cm (unfold)    60cm x 42cm x 4cm (fold)"
    ],
    "img": 3,
    "video": [
      "src=\"https://player.vimeo.com/video/74038731?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "mitle",
    "name": "Mitle",
    "description": "kettle for milk formula",
    "type": "product-design",
    "for": "Houseware Design - BA(Hons) in Design",
    "published": "May 2013",
    "feature": "",
    "innerDescription": [
      "Mitle is a kettle for preparing quick and hygienic milk formula for babies. It boils water in a very short time for killing bacteria, which cannot be filtered. Then cool it down immediately to body temperature 37℃. Within 5 minutes, a bottle of milk can be prepared for babies. When babies feel hungry, parents would feed them as soon as possible because parents care so much. This is a new opportunity for the kettle market."
    ],
    "img": 2
  },
  {
    "meta": "re3orn",
    "name": "Re3orn",
    "description": "CG animation",
    "type": "multimedia-design",
    "for": "Re3orn team",
    "published": "May 2013",
    "feature": "",
    "innerDescription": [
      "This is a product explaination animation. I was responsible for story board and animation. Product is designed by Tam Chun For, Ma Ka Yee and Chan Wai Fan."
    ],
    "img": 0,
    "video": [
      "src=\"https://player.vimeo.com/video/73778716?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\"",
      "src=\"https://player.vimeo.com/video/73778181?byline=0&amp;portrait=0&amp;color=FCD110\" width=\"672\" height=\"378\" frameborder=\"0\" webkitallowfullscreen=\"\" mozallowfullscreen=\"\" allowfullscreen=\"\""
    ]
  },
  {
    "meta": "eat-chit-chat",
    "name": "Eat.Chit.Chat",
    "description": "upcycling spoons",
    "type": "product-design",
    "for": "Community Design - BA(Hons) in Design",
    "published": "Apr 2013",
    "feature": "",
    "innerDescription": [
      "It is a story about community. I wanted to collect the bottles from anyone that played basketball with me. I then upcycled the bottles into tableware. I can show the final product to them and give them as a gift when we have a meal, or eat-chit-chat."
    ],
    "img": 2
  },
  {
    "meta": "mirror-boombox",
    "name": "Mirror Boombox",
    "description": "minicooper speaker",
    "type": "product-design",
    "for": "iUi Design",
    "published": "Aug 2013",
    "feature": "",
    "innerDescription": [
      "This is a project cooperating with MINI. I decided to use the form of the mirror of MINI Cooper to design the Bluetooth speaker as it is a very iconic element of the car. I suggested designing it with different colors or patterns that MINI use always."
    ],
    "img": 2
  }
]
