let myCV = [
	{
		"jobCompany" : "Kool Ltd",
		"companyDesc" : "*Kool Ltd. is a Hong Kong company that designs and manufactures high-quality, innovative kitchen and household products under the renowned Kool brand, as well as for other brands..",
		"jobTitle" : "Product Designer",
		"jobDate" : "2021.09 - Present",
		"jobAchieve" : {
			"Design" : [
				"Initiated the development of the OBM Kool brand and multiple ODM customer projects, delivering customer-centric designs aligned with brand identity.",
				"Orchestrated the design of a cohesive e-commerce platform, ensuring brand consistency across digital touchpoints, driving increased online visibility and sales.",
				"Collaborated on the 'Inno-Team' in a design thinking initiative led by a certified design thinking facilitator, working with cross-functional teams to ideate improvements, contributing design ideas that drove business innovation.",
				"Developed a virtual prototyping web app built on the 'Inno-Team's insights, enabling clients to interact with 3D models, modify colors, and visualize designs in mixed reality, reducing physical prototyping costs and time.",
			],
			"AI Integration" : [
				"Leveraged AI-driven graphic design tools to enhance creative workflows, producing high-quality visuals for branding and customer projects with improved speed and precision.",
				"Utilized AI-powered research tools (e.g., Perplexity) to conduct rapid, in-depth market analysis, delivering actionable insights to support strategic decision-making.",
				"Coded the virtual prototyping web app using AI-assisted programming tools, enabling efficient development without requiring deep mastery of complex libraries."
			],
			"Marketing and Operation" : [
				"Conducted market analysis using platforms like Euromonitor and ChinaHow, providing data-driven insights to inform competitive business strategies.",
				"Managed the implementation of a customized laser engraving service, successfully targeting a niche market for personalized products.",
			],
		}
	},
	{
		"jobCompany": "Computer Academy",
		"companyDesc": "Computer Academy is a leading software training company in Hong Kong, providing comprehensive courses for organizations and individual learners seeking to enhance their software expertise.",
		"jobTitle": "Part-time Trainer",
		"jobDate": "2012.12 - Present",
		"jobAchieve": {
		"Experienced Multilevel Trainer": [
		  "Over 10 years of teaching experience, guiding students of all levels, from secondary school to professionals, for both career advancement and personal fulfillment.",
		  "Proficient in delivering Photoshop, Illustrator, Indesign, Premiere Pro, and Excel courses in both English and Chinese."
		],
		}
	},
	{
		"jobCompany": "Arctomys",
		"companyDesc": "*Arctomys was a Hong Kong-based fashion and accessories brand, co-founded by two local designers",
		"jobTitle": "Co-founder",
		"jobDate": "2018.05 - 2021.09",
		"jobAchieve": {
		"Achievement" : "Secured a Miffy license from 2019 - 2021 and developed three character-inspired bags, including a top-selling bucket bag, driving strong market demand and expanding the brand’s reach.",
		"Design & Opetation": [
			"Co-designed a collection of versatile bags, including the EABA bucket bag, TOFLIP tote bag, and Demas sacoche bag, blending functionality with style to cater to diverse lifestyles.",
			"Created and photographed a compelling lookbook for three flagship products, which secured initial consignment deals with retailers.",
			"Oversaw production to ensure quality, enhancing user experience and market appeal.",
			"Led social media strategy, creating engaging posts to promote the bags and grow the brand's audience."
		],
		}
	},
	{
		"jobCompany": "Homeasy Enterprise Ltd.",
		"companyDesc": ["*Homeasy was a kitchenware and bakeware design and manufacturing company. // *QDO was a distinguished Scandinavian brand, known for its exceptional tea and coffee products. // *Hailo China was the Chinese division of a leading German brand, renowned for its ladders and waste bins."],
		"jobTitle": "Designer",
		"jobDate": "2020.12 - 2021.09",
		"jobAchieve": {
		"Branding, Marketing, and Management": [
			"Design lead for three brands: Homeasy, QDO, and Hailo China.",
			"Maintained the visual identity of the brands and established style guides.",
			"Coordinated with outsourced digital marketers to implement marketing strategies.",
			"Conducted engaging e-commerce photoshoots to enhance customer interest and drive conversions.",
		],
		"Graphic and Product Design and Management": [
			"Developed web design concepts for online platforms.",
			"Collaborated with outsourced designers on various product design projects.",
			"Oversaw the recruitment and mentoring of junior designers.",
		],
		"Project Management" :[
			"Established quality assurance (QA) guidelines with engineers.",
			"Created project schedules and ensured timely execution.",
			"Communicated with factory engineers to coordinate production processes."
		],
		}
	},
	{
		"jobCompany": "KAI Cutlery (H.K.) Ltd.",
		"companyDesc": "*KAI is a Japanese group company founded in 1908, specializes in Japanese cutlery, kitchen utensils, beauty care products, etc.",
		"jobTitle": "Designer",
		"jobDate": "2019.07 - 2020.10",
		"jobAchieve": {
			"Achievement": [
			  "Successfully brainstormed and generated innovative ideas for kitchen gadgets and knives and developed with engineers, resulting in a patent-worthy solution approved by the company's headquarters as exclusive intellectual property:",
			  {
			  	"text": "Snap 'n Flag: Customizable knife storage system (JP patent: 特許6704558 刃物収納具)",
			  	"link": "https://ipforce.jp/patent-jp-B9-6704558"
			  },
			  {
			  	"text": "My Blockᐩ: Attachable sheaths knives set (JP patent: 特許6688948 刃物収納具セット)",
			  	"link": "https://ipforce.jp/patent-jp-B9-6688948"
			  },
			],
			"Marketing Material Design":[
				"Conducted professional photoshoots to capture high-quality images of the products.",
				"Designed storyboards, shot and edited product demonstration videos or computer-generated animations for marketing materials to effectively showcase the products.",
				"Designed attractive and functional packaging for the products.",
			],
			"Elevated retail shop visual merchandising":[
				"Redesigned eye-catching gondolas for Citysuper",
				"Redesigned captivating islands and knife cabinets for AEON",
				"Designed impressive lightboxes and redesigned store displays for KAI shops",
			]
		},
	},
	{
		"jobCompany": "Slick Case",
		"companyDesc": "*Slick Case was a Hong Kong company that sold accessories for Apple Inc. products, such as iPhone cases, MacBook cases, Apple Watch interchangeable bands, etc.",
		"jobTitle": "Part-time Designer",
		"jobDate": "2019.07 - 2020.10",
		"jobAchieve": {
			"Increased Social Media Engagement": "Collaborated with the marketing team to create visuals for social media campaigns, resulting in a significant increase in engagement.",
			"Enhanced Online Advertising":"Designed graphics and motion graphics for web banners, social media news feeds, and online advertisements, contributing to a more visually appealing and effective advertising strategy.",
			"Brand Identity Integration":"Worked collaboratively with the marketing team to ensure visual designs were in line with marketing goals and objectives."
		},
	},
	{
		"jobCompany": "Kool Ltd.",
		"companyDesc": "Kool Ltd., based in Hong Kong, served as an OEM and ODM company, specializing in the design and manufacturing of kitchen and household products.",
		"jobTitle": "Product Designer",
		"jobDate": "2016.02 - 2018.06",
		"jobAchieve": {
			"Achievement": [
			  {
			  	"text": "2017 Golden Pin Design Award - Dual Citrus Reamer Tongs",
			  	"link": "Dual citrus reamer tongs - cerf.pdf"
			  },
			  {
			  	"text": "IDA Design Awards 17 Third Prize - Dual Citrus Reamer Tongs",
			  	"link": "IDA2016_mpdf.pdf"
			  },
			],
			"Product design and development" : "Led the end-to-end product design process, from conducting research and ideation to CAD modeling and prototype development, managing 3D printing and collaborating with engineers, and overseeing manufacturing, ensuring innovative and competitive product designs.",
			"Web Design and Launch" : [
				"Created visually appealing web graphics and user interfaces",
				"Developed web prototypes and effectively communicated the design to web developer.",
				"Managed web content and ensured a seamless user experience"
			],
			"Graphic, Multimedia, and Other Designs" : [
				"Conducted professional photo shoots, including lighting, prop selection, composition, and retouching, developed storyboards and promotional videos",
				"Designed packaging and point-of-sale displays / CDUs for products",
				"Designed booths and interiors for trade shows and events."
			]
		},
	},
	{
		"jobCompany": "Fang Studio Ltd.",
		"companyDesc": "*Fang Studio Ltd. was a Hong Kong based design consultancy founded by Dutch designer Danny Fang.",
		"jobTitle": "Designer",
		"jobDate": "2015.08 - 2016.02",
		"jobAchieve": {
			"Kickstarters": [
				"Contributed to two successful Kickstarter campaigns through product shooting, design of promotional materials, creation of engaging landing pages, and preparation of social media and press marketing content:",
				{
					"text": "High5Dogs - CLIC, the Ultimate Leash for Dogs in the City",
				  	"link": "https://www.kickstarter.com/projects/clic/clic-the-multi-functional-leash-bring-your-dog-eve"
				},
				{
				  	"text": "VICIOUSVENOM - Sleek Unisex Waterproof Bags. THE ELEMENTS COLLECTION",
				  	"link": "https://www.kickstarter.com/projects/304020492/the-elements-collection-sleek-unisex-dry-bags"
				},
			],
			"Product design" : "Specialized in pet product and furniture design"
		},
	},
	{
		"jobCompany": "BIC Ltd.",
		"companyDesc": "*BIC Ltd. was an online consultancy providing professional and affordable solutions to a wide variety of businesses by creating efficient and effective digital solutions.",
		"jobTitle": "Part-time Web Designer",
		"jobDate": "2013.10 - 2014.09",
		"jobAchieve": {
			"": [
				"Created visually appealing web inner pages and EDM designs and developed prototypes to showcase design concepts.",
				"Designed brand logos, letterheads, web banners, and leaflets."
			]

		},
	},
	{
		"jobCompany": "Fang Studio Ltd.",
		"companyDesc": "*Fang Studio Ltd. was a Hong Kong based design consultancy founded by Dutch designer Danny Fang. // *Elephant Parade is a social enterprise with a unique combination of art, business & conservation.",
		"jobTitle": "Internship",
		"jobDate": "2014.06 - 2014.08",
		"jobAchieve": {
			"Elephant Parade Hong Kong 2014": "Participated in art production, including idea brainstorming, woodwork, paper-pattern making, patchwork stitching, and stuffing.",
			"Product Design" : "Assisted in the development of product designs and production for the High5Dogs brand."
			

		},
	},
	{
		"jobCompany": "Plastoform Industries Ltd.",
		"companyDesc": "*Plastoform Industries Ltd. was providing high-quality wireless audio speakers with custom-made solutions. ",
		"jobTitle": "Product Designer",
		"jobDate": "2011.08 - 2012.08",
		"jobAchieve": {
			"Audio Product Design": [
				"Designed MINI licensed Bluetooth speaker launched at CEF",
				"Developed designs for portable speakers, headphones, and electronic gadgets.",
			]
		},
	},
]
